Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །འདོད་པའི་འདོད་ཆགས་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་དང་། དབྱིབས་ཀྱི་འདོད་ཆགས་དང་། རེག་པའི་འདོད་ཆགས་དང་། མོས་པའི་འདོད་ཆགས་དང་། ཡིད་ཀྱི་ཀུན་ཏུ་རྟོགས་པའི་འདོད་ཆགས་གང་ཅི་ཡང་རུང་བ་དེ་ཐམས་ཅད་ནི་འདུ་བྱེད་ཀྱི་འབྱོར་འབྲེལ་གྱི་རྐྱེན་ལས་འབྱུང་ན། སུས་འདུ་བྱེད་དེ་དག་མངོན་པར་འདུས་བྱས་ཤིང་སུ་ཞིག་ནི་མངོན་པར་འདུ་བྱེད་ཅེ་ན།
en: They will think, ‘If all types of attachment—the attachments related to the desire realm, the form realm, the formless realm, shape, contact, imagination, and concepts—arise on account of the connection of formations, who has produced those formations? Who is producing them?

source: རླུང་གིས་མངོན་པར་འདུས་བྱས་པའོ།
en: They are produced by the winds.

source: །བདག་གི་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་འདུ་བྱེད་དེ་དག་དང་རླུང་ཡང་རྣམ་པར་གཞིག་པར་བྱའོ།
en: My physical, verbal, and mental formations, as well as those winds, must therefore be destroyed!

source: །རླུང་དེ་དག་ནི་ཁ་དང་སྣ་དག་ནས་འཇུག་ཅིང་འབྱུང་སྟེ།
en: The winds enter and leave from my mouth and nose.

source: རླུང་དེ་དག་གིས་མངོན་པར་འདུས་བྱས་སོ། །རླུང་དེ་དག་ཉིད་ཀྱིས་ལུས་འདི་རྣམ་པར་གཏོར་ཞིང་རྣམ་པར་གཞིག་པར་བྱའོ་སྙམ་ནས་དེ་དེ་ལྟར་སེམས་ལ་དབུགས་རྔུབ་པར་བྱེད་དེ། དབུགས་གང་དག་འཇུག་པར་བྱེད་པ་དེ་དག་ནི་ཤ་དང་ཁྲག་སྐེམས་པར་བྱེད་དོ། །མེད་པར་བྱེད་དོ།
en: It is these winds that have produced the formations, so the very same winds must break apart and destroy this body!’ Thinking in that way, they will imagine that the breaths that are drawn in and expelled dry out their flesh and blood and cause them to disappear.

source: །གང་དག་འབྱུང་བར་བྱེད་པ་དེ་དག་ནི་ཤ་དང་ཁྲག་དེ་ལུས་ཀྱི་ཕྱི་རོལ་དུ་འདོར་བར་བྱེད་དོ་ཞེས་བྱ་བ་ནས་ལུས་ཐམས་ཅད་བུ་གར་གྱུར་པར་མཐོང་བའི་བར་དང་། རྨའི་སྒོ་ཐམས་ཅད་ནས་དབུགས་འཇུག་ཅིང་འབྱུང་ལ་སྐྲ་དང་། སེན་མོ་དང་། ཤ་དང་། ཁྲག་གཞི་ནས་འབྱིན་ཅིང་ལུས་ཀྱི་ཕྱི་རོལ་དུ་འདོར་བར་བྱིན་གྱིས་རློབ་པར་བྱེད་པའི་བར་དང་། ཤ་དང་ཁྲག་ཐམས་ཅད་མ་ལུས་པར་ལུས་ཐམས་ཅད་ལ་མི་མཐོང་བར་བྱེད་པའི་བར་དང་། རུས་གོང་གི་ཕུང་པོ་སྟོང་ཞིང་དཀར་ལ་དུང་གི་མདོག་ལྟ་བུ་དང་། རྒྱུས་པས་འབྲེལ་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་ཅིང་ཡིད་ལ་བྱེད།
en: The breaths that are exhaled will discard their flesh and blood outside of their bodies, until they see that their entire bodies have become hollow. They will then visualize how the inhalation and exhalation of the breath through all their orifices fully extracts their hairs, fingernails, flesh, and blood and removes them from their body. This will cause the entirety of their flesh and blood to disappear from their body, until they consider, contemplate, cultivate, and visualize the heaps of bare bones that are white like conch shells and connected with ligaments.

source: སྒོམ་པར་བྱེད་ལ་དེ་ཉིད་བྱིན་གྱིས་རློབ་པར་བྱེད་པའི་བར་དང་། གང་དེ་ལ་སྔར་འདོད་པའི་འདོད་ཆགས་ཀྱི་སེམས་དང་རྗེས་སུ་འབྲེལ་བར་བྱུང་བ་དེ་སེམས་མཉམ་པར་གཞག་པ་ལ་ཉམས་དམས་པར་འགྱུར།
en: “While settled in mental equipoise, their previous connections to the state of attachment related to the desire realm will decline and diminish.

source: བསྲབས་པར་འགྱུར་ཞིང་དེ་བཞིན་དུ་གཟུགས་ཀྱི་འདོད་ཆགས་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་དང་། དེ་བཞིན་དུ་དབྱིབས་ཀྱི་འདོད་ཆགས་དང་། དེ་བཞིན་དུ་རེག་པའི་འདོད་ཆགས་དང་། དེ་བཞིན་དུ་མོས་པའི་འདོད་ཆགས་དང་། ཀུན་ཏུ་རྟོག་པའི་འདོད་ཆགས་འགོང་བར་འགྱུར་ཞིང་བསྲབས་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: Similarly, their attachment related to the form realm, the formless realm, shape, contact, imagination, and concepts will also be suppressed and reduced.

source: །གང་གི་ཚེ་ཡང་དེའི་སེམས་མཉམ་པར་མ་བཞག་པ་ན་ཡང་དང་ཡང་དུ་རྐྱེན་ཇི་ལྟ་བུ་རྙེད་པ་དེ་ལྟ་བུ་དེ་ཆུ་ཚོད་གཅིག་ཙམ་དུ་གཟུགས་ཁ་ཅིག་ལ་ཞེས་བྱ་བ་ནས། རེག་པ་ཁ་ཅིག་ལ་ཞེས་བྱ་བའི་བར་ལ་རྣམ་པར་ཉམས་པར་འགྱུར་རོ།
en: However, when their minds are no longer settled in equipoise, they will, according to the circumstances they encounter, be repeatedly and temporarily weakened in relation to objects ranging from form to contact.

source: །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གི་རིས་འཐུན་པས་འདོད་ཆགས་གཞི་དང་བཅས་པ་གང་ཡིན་པ་དེ་བཅད་ལ་མ་ལུས་པར་བྱ་བ་ཡིན་ནོ།
en: They will then think, ‘In accordance with my class, I must cut off and eliminate attachment and its basis!

source: །དཔེར་ན་དྲུངས་ནས་ཕྱུང་བ་མ་ཡིན་པའི་ཤིང་བཅད་པ་ནི་ཕྱིས་ཀྱང་སྐྱེ་བར་འགྱུར། དེ་བཞིན་དུ་སྲེད་པའི་བག་ལ་ཉལ་མ་བཏོན་པ་སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ཕྱི་ཕྱིར་སྐྱེད་དེ། དེ་ཉིད་ལ་སྒོམ་པར་བྱེད་དེ། ཇི་ལྟར་རང་གི་ལུས་ལ་ཀེང་རུས་དཀར་ཞིང་དུང་གི་མདོག་ལྟ་བུ་རྒྱུས་པས་འབྲེལ་བ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་བྱེད་པའི་བར་དུའོ།
en: Just as a tree that has been cut but not uprooted may still continue to grow, so will the latent imprints of craving that have not been eliminated eventually generate various types of suffering.’ They will therefore meditate on this until they perceive their bodies as skeletons, white like conch shells and connected with ligaments.

source: །དེ་བཞིན་དུ་གཟུགས་སྣང་བ་གང་ཅི་ཡང་རུང་། སེམས་ཅན་ནམ། སེམས་ཅན་མ་ཡིན་པ་ཡང་རུང་སྟེ། མིག་སྔར་སྣང་བར་གྱུར་ན་དེས་ཐམས་ཅད་དུ་དེ་ལྟ་བུར་ཐམས་ཅད་ཀེང་རུས་མདོག་དཀར་པོ་རྒྱུས་པས་འབྲེལ་བར་ལྷག་ཆད་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: Similarly, when any kind of form—whether sentient or not—appears before their eyes, they will systematically perceive such forms as white skeletons connected with ligaments, without adding or omitting anything.

source: །དེ་ལས་དེའི་སེམས་རྣམ་པར་གཡེང་བར་ཡང་མི་བྱེད་དེ།
en: They will not let their minds be distracted from this.

source: འདི་ནི་དེའི་ཞི་གནས་ཡིན་ནོ།
en: This is their practice of tranquility.

source: །དེའི་ཚེ་ཡང་འདི་ལྟར་སོ་སོར་ཡང་དག་པར་སློབ་པར་བྱེད་དེ། འདི་ནི་མགོའི་ཐོད་པའི་རུས་པའོ། །འདི་དག་ནི་སོ་རྣམས་སོ། །འདི་ནི་མགྲིན་པའོ་ཞེས་བྱ་བ་ནས་འདི་དག་ནི་རྐང་པའི་མཐེ་བོའི་རུས་པ་རྣམས་སོ་ཞེས་བྱ་བར་དེའི་ལྷག་མཐོང་དང་མཚུངས་པར་ལྡན་པའི་སེམས་ཀྱི་བསམ་གཏན་སྒྲུབ་པར་བྱེད་དོ།
en: “At that time, they will train by observing, ‘These are the bones of the skull, these are the teeth, and this is the throat,’ all the way down to ‘These are the bones of the toes.’ In that way, they will accomplish mental concentration that is joined with insight.

source: བསམས་བཞིན་དུ་བསམ་གཏན་སྒྲུབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because they accomplish concentration intentionally.

source: །གང་དུ་དེའི་སེམས་ཤིན་ཏུ་ཡང་དག་པར་གནས་ཤིང་རབ་ཏུ་དང་བར་གྱུར་ན་དེས་དེ་བསྒོམ་པར་བྱ་སྟེ།
en: When their minds become utterly still and tranquil, this should be their meditation.

source: ལྷག་མཐོང་གཅིག་པུ་ལ་སེམས་ཤིན་ཏུ་ཡང་དག་པར་གནས་ཤིང་རབ་ཏུ་དང་བར་གྱུར་ན་ཡང་དེས་དེ་བསྒོམ་པར་བྱའོ།
en: When their minds become utterly still and tranquil, they should cultivate that while practicing insight alone.

source: །ལྷག་མཐོང་གཅིག་པུ་ལ་སེམས་ཤིན་ཏུ་ཡང་དག་པར་གནས་ཤིང་རབ་ཏུ་དང་བར་གྱུར་ན་དེས་འདི་ལྟར་བསྒོམ་པར་བྱ་སྟེ། རུས་པའི་ཕུང་པོ་སོ་སོར་ཐ་དད་པར་རུས་པ་རྣམས་ལ་སོ་སོར་བརྟགས་ཤིང་བཤིག་ལ་སོ་སོར་བརྟགས་ནས་རྣམ་པར་ཕྱེ་མར་བྱས་ཏེ་སོ་སོར་བརྟག་གོ།
en: When their minds become utterly still and tranquil while practicing insight alone, they should cultivate that by examining and disintegrating the heaps of bones and grinding them into dust.

source: །དེར་རུས་གོང་གི་ཕྱེ་མ་རྣམས་ལ་སེམས་ཀྱི་འདུ་འཕྲོད་གང་ཡིན་པ་དེ་རྒྱུ་མེད་པ་མ་ཡིན་པ་དང་། ཟད་པ་དང་འཇིག་པའི་མཚན་ཉིད་དུ་སོ་སོར་བརྟག་པར་བྱའོ།
en: They should then consider how the mental observation of this dust of bones is not uncaused but rather has the characteristic of being exhaustible and perishable.

source: །དེ་ལྟར་ལྷག་མཐོང་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་མངོན་པར་རྟོགས་པར་འགྱུར་བ་ཡིན་ནོ།
en: In that way, they will realize the acceptance that accords with insight.

source: །གཟུགས་སྣང་བ་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་རུས་གོང་གི་ཕྱེ་མ་ཤིན་ཏུ་དཀར་པོ་ལ་འདུ་འཕྲོད་ཀྱི་རྒྱུ་གང་། སེམས་མགྱོགས་པ་དང་ཀུན་ཏུ་མགྱོགས་པ་ལ་སོ་སོར་རྟོག་པ་འབྱུང་བ་འདི་ནི་སྐྱོ་བ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་མངོན་པར་རྟོགས་པར་འགྱུར་བ་ཡིན་ནོ། །གཟུགས་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་རུས་གོང་གི་ཕྱེ་མ་ཤིན་ཏུ་དཀར་པོ་ངོ་བོ་ཉིད་མེད་པ་ལ་འདུ་འཕྲོད་ཀྱི་རྒྱུ་དང་། སེམས་མགྱོགས་པ་དང་ཀུན་ཏུ་མགྱོགས་པ་ལ་སོ་སོར་རྟོག་པ་བདག་མེད་པ་དེ་ནི་འཇིག་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་མངོན་པར་རྟོགས་པར་འགྱུར་བ་ཡིན་ནོ།
en: “Because they observe the completely white dust of bones in all material appearances and because they understand that the mind is quick and swift, they will also directly understand the acceptance that accords with arising. Because they observe the insubstantial nature of the completely white dust of bones, which they perceive without attachment in all forms, and because they understand the lack of self in the mind that is quick and swift, they will directly understand the acceptance that accords with disintegration.

source: །གཟུགས་སྣང་བ་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་རུས་གོང་གི་ཕྱེ་མ་ཤིན་ཏུ་དཀར་པོ་དག་ལ་བརྗོད་དུ་མེད་པ་དང་། སྣུམ་པ་མེད་པ་དང་། གཟུང་བ་མེད་པ་དང་། མཉམ་པར་གནས་པ་མ་ཡིན་པ་དང་། ཅི་ཡང་མེད་པ་འདི་ནི་ཞི་བའི་ཞི་གནས་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་མངོན་པར་རྟོགས་པར་འགྱུར་བ་ཡིན་ནོ།
en: Because they observe the lack of expressibility, fondness, apprehension, equipoise, and existence with regard to the completely white dust of bones, which they perceive without attachment in all forms, they will directly understand the acceptance that accords with peaceful tranquility.

source: །དེས་བཟོད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་དུས་གསུམ་གྱི་འདོད་ཆགས་དག་འདོད་ཆགས་ལས་ཡང་དག་པར་སྒྲོལ་བ་དང་། ཡང་དག་པར་ལྡང་བར་བྱེད་པ་དང་། རྣམ་པར་རྟོག་པ་མཉམ་པ་དང་། རྟེན་མཉམ་པ་དང་། དུས་གསུམ་གྱི་མཐའ་སྤོང་བར་འགྱུར་ཞིང་སྲེད་པ་གསུམ་གྱི་མཐའ་སྤོང་བ་དང་། ཁམས་གསུམ་པའི་སྲིད་པ་ལྡོག་ཅིང་ཉེ་བར་ཞི་བ་དང་། དྲི་མ་གསུམ་སྤོང་བ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཐོབ་པར་འགྱུར་ཞིང་ཀུན་ཏུ་སྦྱོར་བ་གསུམ་སྤངས་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་རོ།
en: “Since they will achieve acceptance, they will free themselves from and rise above attachment related to the three times. Their thoughts will be peaceful, their basis will be stable, and they will abandon the limits of the three times. They will abandon the limits of the three types of craving, turn away from and pacify the three realms of saṃsāra, abandon the three types of defilements, achieve the three gateways of liberation, and eliminate the three types of fetters. At that point they will achieve the fruition of the stream enterers.

source: །གཞན་ཡང་ཡང་དག་པར་མཚན་གྱི་གཞི་མེད་པའི་ཆོས་རྣམས་བསྒོམ་པ་ལ་བརྩོན་པ་ནི་དགྲ་བཅོམ་པའི་འབྲས་བུ་ལ་གནས་པར་འགྱུར་རོ།
en: Furthermore, through their efforts in becoming accustomed to the fact that phenomena are devoid of true characteristics, they will settle within the fruition of the worthy ones.

source: །གཞན་ཡང་སུས་གཟུགས་སྣང་བ་ཐམས་ཅད་དག་ཅིང་དཀར་ལ་དུང་གི་མདོག་ལྟ་བུ་ཆགས་པ་མེད་པ། རྒྱུས་པ་དང་འབྲེལ་བའི་རུས་གོང་གི་ཕུང་པོ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ན་ནི་དེར་དེའི་སེམས་ཤིན་ཏུ་ཡང་དག་པར་གནས་པར་གྱུར་ཏེ།
en: Moreover, those who perceive all material appearances as heaps of bones that are pure, white like conch shells, and connected with ligaments will obtain highly tranquil minds.

source: འགྲོ་བ་དང་། གནས་པ་དང་། འདུག་པ་དང་། ཉལ་བ་ན་དེ་ཉིད་ཡིད་ལ་བྱའོ།
en: They will contemplate this while walking, standing, sitting, and lying down.

source: །དེས་དེ་ཉིད་ཡིད་ལ་བྱས་ཤིང་དེ་ཉིད་བསྒོམས་ལ་དེ་ཉིད་བྱིན་གྱིས་བརླབས་ན་དེ་ལྟར་དེའི་ཞི་གནས་ཤིན་ཏུ་བསྒོམས་ཤིང་ཤིན་ཏུ་སྦྱང་བ་བྱས་པའི་བར་དུ་འགྱུར་རོ།
en: If they contemplate, cultivate, and visualize that, their practice of tranquility will become utterly proficient and refined.

source: །དེའི་ཚེ་རྣལ་འབྱོར་པ་ཕྱི་ནང་བདག་མེད་པ་སྟོང་པ་ཉིད་ལ་འཇུག་སྟེ།
en: “At that moment, the practitioners will understand inner and outer selflessness and emptiness.

source: གཟུགས་ཐམས་ཅད་ཀྱི་རུས་གོང་གི་ཕུང་པོ་ལ་གལ་ཏེ་སྔོན་པོའི་འདུ་ཤེས་བྱུང་ན་དེར་རུས་གོང་གི་ཕུང་པོ་སྔོན་པོ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་ཞེས་བྱ་བ་ནས་གལ་ཏེ་ཤེལ་གྱི་མདོག་ལྟ་བུ་ཡིད་ལ་བྱེད་ན་དེས་གཟུགས་སྣང་བ་ཐམས་ཅད་རུས་གོང་གི་ཕུང་པོ་ཤེལ་གྱི་མདོག་ལྟ་བུའི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: If a perception of blue should arise in them in relation to those heaps of bones that they visualize in all forms, they will perceive the heaps of bones to be blue. If they should contemplate any of the other colors up to crystalline, they will perceive all material appearances as heaps of bones in those respective colors up to crystalline.

source: །དེར་དེའི་རྣམ་པར་རྟོག་པ་འབྱུང་སྟེ།
en: These thoughts will arise in them:

source: ཅིའི་ཕྱིར་འདི་གཟུགས་སྣང་བ་ཐམས་ཅད་རུས་གོང་གི་ཕུང་པོ་དཀར་པོར་ཡང་དག་པར་སྣང་།
en: ‘Why do all material appearances appear as white heaps of bones?

source: ཅིའི་ཕྱིར་ཤེལ་གྱི་མདོག་ལྟ་བུའི་བར་དུ་ཡང་དག་པར་སྣང་སྙམ་མོ། །
en: Why do they appear as other colors up to crystalline?’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་དག་ཐམས་ཅད་སེམས་ཀྱི་བྲག་ཅ་ཡིན་པའི་ཕྱིར་གསོབ་ལ་བརྫུན་པ་སྟེ་ཐམས་ཅད་སེམས་སྣང་བ་ཡིན་ནོ། །སུས་དེ་ལྟར་ཤེས་པ་དེ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་སྦྱིན་གནས་ཡིན་ཞིང་མཆོད་པར་འོས་པ་ཡིན་ནོ།
en: They will then think, ‘Since these are all the echoes of my mind, they are empty and fake—they are all mental projections!’ Those who understand in that way are worthy recipients of the generosity of the whole world.

source: །ཀཽ་ཌི་ནྱ་འདི་ནི་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་དང་ཟས་ལ་མི་འཐུན་པའི་འདུ་ཤེས་མ་གཏོགས་པར་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པའི་དོན་ཡིན་ནོ།
en: Kauṇḍinya, with the exception of the perception of dislike or the perception of disgust toward food, this is the meaning of the acceptance that accords with the absence of wishes.

source: །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོས་གང་ང་ལ་བསྐུར་བ་ཡིན་ནོ།
en: This is what the thus-gone Royal Mass of Glorious Wisdom conferred upon me.”

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཀྱི་བློ་གྲོས་བཟང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཞི་གནས་ཀྱི་བསམ་པ་ཅན་སུས་དེ་ལྟར་བསྒོམས་ན་མི་སྡུག་པ་སྒོམ་པར་བགྱིད་པ་ལགས།
en: The bodhisattva Sumati then asked, “Respected Blessed One, when the hearers who wish to practice tranquility do so in that way, they will practice repulsiveness.

source: དེར་མཚན་མ་གང་དག་འབྱུང་བ་ལགས།
en: What signs will arise in them?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སུས་འདོད་ཆགས་ཟད་པར་བྱ་བའི་ཕྱིར་གང་མི་སྡུག་པ་སྒོམ་པར་བྱེད་པ་དེའི་འཕྲལ་བར་སེམས་གཏད་པར་བྱའོ།
en: The Blessed One replied, “Those who cultivate repulsiveness in order to exhaust their attachments should direct their attention to their foreheads.

source: །དེའི་མཚན་མ་འདི་དག་འབྱུང་སྟེ།
en: The following signs will arise in them:

source: ཇི་སྲིད་དུ་མི་སྡུག་པའི་སེམས་ཀྱིས་སོ་སོར་རྟོག་པར་འགྱུར་བ་དེ་སྲིད་དུ་དེའི་ལུས་ཐམས་ཅད་གཡོ་ཞིང་ཀུན་ཏུ་གདུང་བར་འགྱུར་རོ།
en: Whenever they conceive of the body with an attitude of revulsion, their entire bodies will begin to shake and ache;

source: །འདི་ནི་དེའི་མཚན་མ་ནང་གི་དང་པོ་ཡིན་ནོ།
en: this is the first sign.

source: །ཇི་སྲིད་དུ་ཡང་དང་ཡང་དུ་སྒོམ་པར་བྱེད་པ་དེའི་རང་གི་ལུས་ཀྱི་གནས་སོ་ཅོག་ཏུ་འདི་སྙམ་བྱེད་དེ། ཕྱར་བ་རྩུབ་པོས་རེག་པ་བཞིན་ནོ་སྙམ་པ་འདི་ནི་དེའི་མཚན་མ་གཉིས་པའོ།
en: Whenever they cultivate this repeatedly, all their body parts will feel as if they are being scraped against a rough surface; this is the second sign.

source: །ཡང་ཕྱི་ཕྱིར་སེམས་རྣམ་པར་གཡེང་བ་མེད་པར་སྒོམ་པར་བྱེད་པ་དེའི་ལུས་ཐམས་ཅད་རབ་ཏུ་སིམ་པར་འགྱུར་ཏེ།
en: Then, those who practice without distraction will eventually experience exhilaration throughout their entire bodies, as if they were filled with milk;

source: ལུས་ཐམས་ཅད་ལ་འོ་མས་བཏབ་པ་བཞིན་ནོ་སྙམ་པ་འདི་ནི་དེའི་སེམས་རྩེ་གཅིག་པ་ཉིད་ཀྱི་ཞི་གནས་ཀྱི་མཚན་མ་ཡིན་ཏེ།
en: this is a sign that their minds abide one-pointedly within a state of tranquility.

source: དེ་དགའ་བ་དང་བདེ་བ་འདི་ཡང་མཚན་མ་མེད་པའི་ཚུལ་གྱིས་སྤོང་བར་བྱེད་དོ།
en: Nevertheless, they will also abandon those feelings of pleasure and well-being by practicing the absence of marks.

source: །དེ་ཡང་དེའི་ངེས་པར་འབྱེད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་སེམས་འདོད་ཆགས་ཀྱིས་ཉེ་བར་ཉོན་མོངས་པ་ཡོངས་སུ་གཏུགས་ཤིང་མ་རིག་པས་ཉེ་བར་ཉོན་མོངས་པའི་ཤེས་རབ་རྣམ་པར་དག་ན་དེ་ལུས་ཐམས་ཅད་རུས་གོང་གི་ཕུང་པོ་ལ་སྡུག་བསྔལ་གྱི་རྣམ་པ་ཤེས་པ་ཞེས་བྱ་བ་ནས་ཞི་བའི་རྣམ་པ་ཞེས་བྱ་བའི་བར་དུ་སོ་སོར་རྟོག་པར་བྱེད་དོ།
en: Furthermore, in order to refine their discernment, their mind will be purified of all afflicted states caused by attachment and will be purified of insight afflicted by ignorance. When that occurs, they will become able to discern the different aspects, from suffering to peace, based on those heaps of bones of all bodies.

source: །དེ་བཞིན་དུ་དེའི་ལུས་ཐམས་ཅད་ལས་དྲོ་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: Next, heat will emerge from their entire bodies.

source: འདི་ནི་དེའི་ཞི་གནས་ཡོངས་སུ་རྫོགས་པ་ཡིན་ནོ།
en: This is the perfection of their practice of tranquility.

source: །དྲོ་བར་གྱུར་པའི་དགེ་བའི་རྩ་བ་དང་། སྔ་ཕྱི་མེད་པའི་བདེ་བ་འཇུག་པས་སེམས་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །བདག་ཉིད་ལྷར་གྱུར་པ་བཞིན་དུ་ཡང་དག་པར་ཤེས་སོ།
en: Through the roots of virtue generated by this heat and the experience of constant bliss, their minds will become pure, and they will know that they are like gods.

source: །ཡང་རུས་གོང་གི་ཕུང་པོ་དེ་ཉིད་ལ་རྣམ་པ་བཞིར་སོ་སོར་རྟོག་པས་རང་གི་འཕྲལ་བ་ན་མར་མེའི་མེ་ལྕེ་མཐོང་ངོ་།
en: By examining those heaps of bones according to this fourfold sequence, they will eventually see flames on their foreheads.

source: །དེ་མ་རིག་པ་ལས་ཡང་དག་པར་འདས་པར་བྱ་བའི་ཕྱིར་ཆེས་ལན་མང་དུ་རང་གི་རུས་གོང་གི་ཕུང་པོ་ལ་ཡང་དང་ཡང་དུ་རྣམ་པ་བཞིར་རྟག་ཏུ་སྣང་བ་དེ་ལྟ་བུར་ཡོངས་སུ་རྟོག་པས་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱི་འཇིག་པ་མི་མཐོང་ངོ་།
en: In order to completely transcend ignorance, they will again and again investigate their heaps of bones according to those experiences; they will repeat this fourfold sequence a great number of times. Thereby, they will not encounter the disintegration of their minds or the phenomena that arise from the mind.’

source: །དེ་ལྟར་འཁོར་ཞིང་མི་གནས་པ་ཉིད་ནི་དཔེར་ན་ཉི་ཟེར་གྱི་རྡུལ་བཞིན་དུ་འཁོར་བར་བྱེད་དོ།
en: “They will then float around in that way without dwelling on anything, like a dust mote in the sunlight.

source: །ཇི་ལྟར་འདུས་བྱས་ཀྱི་དངོས་པོ་ཐམས་ཅད་ལ་འདུ་ཤེས་མཆོག་གིས་མཐོང་བ་དེ་བཞིན་དུ་འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པ་ཞེས་བྱ་བ་ནས་འགོག་པའི་ཆོས་ཀྱི་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་ཏེ།
en: As they now see all conditioned things through their eminent perception, they will correctly understand that all conditioned phenomena are selfless [. . .] and subject to cessation;

source: དེ་ནི་དེའི་རྩེ་མོའི་དགེ་བའི་རྩ་བ་ཐོབ་པའོ།
en: this is their attainment of the root of virtue of the summit.

source: །ཡང་རང་གི་ལུས་ལ་མེ་ཤི་བ་དང་ཀུན་ཏུ་རབ་ཏུ་འབར་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །ཕྱོགས་ཐམས་ཅད་དུ་སྣང་བ་ཆེན་པོ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: Furthermore, they will also see fires dying and blazing up on their bodies, as well as brilliant lights shining in the ten directions;

source: །དེ་ནི་དེའི་བསམ་གཏན་དང་པོའི་སའི་ལམ་ཡིན་ཏེ།
en: this is the path of the first concentration.

source: དེ་བཞིན་དུ་གཟུགས་ན་སྤྱོད་པའི་དགེ་བའི་རྩ་བ་རྣམས་དང་། གཟུགས་ན་སྤྱོད་པའི་འབྱུང་བ་ཆེན་པོ་རྣམས་ཐོབ་པར་འགྱུར་རོ།
en: Similarly, they will attain the roots of virtue as well as the great elements of the form realm.

source: །དེ་བཞིན་དུ་གཟུགས་ན་སྤྱོད་པའི་བདེ་བ་ཆེན་པོས་ལུས་ཐམས་ཅད་ཁྱབ་པར་འགྱུར་རོ།
en: Their entire bodies will be pervaded by the great bliss of the form realm.

source: །དེ་བཞིན་དུ་དེའི་སྙིང་ག་ནས་ཀྱང་ཉི་མའི་འོད་ཟེར་དག་འབྱུང་ངོ་། །ཕྱོགས་གང་དང་གང་མཐོང་བ་དང་ཡིད་ཀྱིས་བརྟགས་པ་ཐམས་ཅད་དུ་ཉི་མའི་དཀྱིལ་འཁོར་གྱི་འོད་ཟེར་རྣམས་ཀྱིས་ཁྱབ་པར་མཐོང་ངོ་།
en: Sunlight will radiate from their hearts, and wherever they look and examine will be filled with light from the sun.

source: །འོད་ཟེར་དེ་རྣམས་ལ་ཡང་སྨོན་པ་མེད་པའི་ཚུལ་གྱིས་སྒོམ་པར་བྱེད་དེ།
en: They will meditate on those light rays in accordance with the absence of wishes.

source: དེ་དེའི་ཚེ་སྲིད་པ་གསུམ་པོ་ཐམས་ཅད་ལ་སྨོན་པ་མེད་པའི་སེམས་ཡིན་ནོ།
en: At that time, their minds will become free from wishes related to the three realms.

source: །དེ་དེའི་ཚེ་ཚུལ་གཅིག་པའི་འཕགས་པའི་བདེན་པ་བཞི་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོང་པ་ཉིད་ལ་བརྩོན་པར་གནས་སོ།
en: They will diligently dwell on emptiness in the same manner without apprehending the four truths of the noble ones.

source: །དེའི་ལུས་ཐམས་ཅད་ལས་ཀྱང་དྲོ་བ་འབྱུང་ངོ་། །སྤྱི་བོ་ནས་ཀྱང་དྲོ་བ་ཁ་དོག་སྣ་ཚོགས་འབྱུང་ངོ་།
en: Heat will emerge from their entire bodies, a multicolored warm glow will emerge from the tops of their heads, and parasols will shelter them above their heads;

source: །སྤྱི་བོའི་སྟེང་དུ་གདུགས་གནས་པར་འགྱུར་བ་འདི་ནི་རྩེ་མོའི་དགེ་བའི་རྩ་བ་ཡིན་ནོ།
en: this is the root of virtue of the summit.

source: །ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ལ་ཡོངས་སུ་རྟོག་པར་བྱེད་དེ།
en: Furthermore, in accordance with nonapprehension they will fully understand the acceptance that accords with the truth.

source: དེའི་ཚེ་འཕགས་པའི་བདེན་པ་བཞི་མངོན་པར་རྟོགས་པར་འགྱུར་རོ།
en: At that time, they will fully understand the four truths of the noble ones.

source: །རིགས་ཀྱི་བུ་འདི་ནི་ཉན་ཐོས་ཀྱི་མི་སྡུག་པ་སྒོམ་པ་ཡིན་ཏེ།
en: “Noble son, this is the hearer’s meditation on repulsiveness.

source: མི་སྡུག་པ་ཤིན་ཏུ་བསྒོམས་པ་དེས་ཞི་གནས་ཐོབ་པར་འགྱུར་རོ། །དེ་ལ་མཚན་མ་འདི་དག་འབྱུང་སྟེ།
en: Those who have thoroughly meditated on repulsiveness will attain tranquility, and those signs will manifest.

source: མཚན་མ་དེ་དག་དང་དད་པ་དེ་ལྟ་བུ་དག་གིས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ལ་གནས་ཤིང་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བ་དང་དགྲ་བཅོམ་པ་ཉིད་ལ་རེག་པར་འགྱུར་རོ།
en: With such signs and faith, they will follow the eightfold path of the noble ones, abandon all afflictions, and reach the level of the worthy ones.

source: །རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འོད་ཟེར་གྱིས་རྒྱལ་བར་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་རྣམས་ལ་ཡིད་ལ་བྱེད་པ་དེ་ལྟ་བུ་སྟོན་ཅིག །མི་སྡུག་པ་བསྟན་པ་འདི་བཤད་པ་ན་དེར་སེམས་ཅན་དཔག་ཏུ་མེད་པ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པ་ནས་དེར་སེམས་ཅན་དཔག་ཏུ་མེད་པ་བདེན་པ་མཐོང་བའི་བར་དུ་གྱུར་ཏོ།
en: Therefore, noble son, you should teach those contemplations to those who follow the vehicle of the hearers within the buddha realm Victorious through Light Rays.” As this teaching on repulsiveness was being given, countless beings present in that place achieved the acceptance that accords with the truth, and countless sentient beings saw the truth.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཞན་ཡང་ཀུན་ཤེས་ཀཽ་ཌི་ནྱ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཌི་ནྱ་གལ་ཏེ་ཐམས་ཅད་ཚུལ་གཅིག་ཅིང་བསམ་པ་གཅིག་པར་གྱུར་ན་གང་གིས་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་བར་འགྱུར་བའི་ཆོས་གཅིག་ཁོ་ན་སེམས་ཅན་རྣམས་ལ་བསྟན་པར་བྱའོ།
en: Then, the Blessed One said to Ājñātakauṇḍinya, “Kauṇḍinya, if everyone could follow the same approach and had the same inclination, I would only have to give sentient beings a single Dharma teaching, through which their minds would be liberated from defilements.

source: །ཇི་སྲིད་དུ་སེམས་རྣམ་པར་མ་ཞི་བ་དེ་སྲིད་དུ་སྲིད་པའི་འབྲས་དང་། ནད་དང་། ཟུག་རྔུ་དང་། ཡང་སྲིད་པ་སྣ་ཚོགས་ཀུན་ནས་སློང་ཞིང་འགྲོ་བ་སྣ་ཚོགས་བྱེད་པས་གང་བདག་གིས་རང་གི་སེམས་བསྡུ་བར་བྱ་ཞིང་སེམས་ཀྱི་མཚན་མ་གཟུང་བར་བྱ་གོར་མ་ཆག་སྙམ་ཞིང་རུས་གོང་གི་ཕུང་པོ་འདི་ཇི་ལྟར་སེམས་ཀྱི་འདུ་འཕྲོད་སྐྱེད་པར་བྱེད་པའི་རྒྱུ་དེ་ལ་རྣམ་པར་རྟོག་པར་བྱེད་པ་འདི་ནི་ལྷག་པའི་སེམས་ཀྱི་སྐྱོན་མེད་པ་ཐོབ་པ་དང་པོ་ཡིན་ཏེ།
en: “Some will think, ‘As long as my mind is not completely pacified, the boils, diseases, and pains of existence will arise, as will the diversity of rebirths and the various destinies. Therefore, I must make sure to control my own mind and take hold of my thinking!’ Thinking in that way, they will think of the heaps of bones as being the cause for generating mental composure. This is the first attainment of faultlessness in those with superior minds.

source: ངན་ངོན་མ་ཡིན་པར་ཐོབ་པ་ཡིན། མཐོང་བའི་ཆོས་ལ་བདེ་བར་གནས་པར་འགྱུར་ཞིང་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ཡིན་ནོ།
en: It will be achieved without difficulty, and in this very life they will live happily and attain the level of nonregression.

source: །གཞན་ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། རྐྱེན་གང་དག་གིས་སེམས་ཀྱི་འདུ་འཕྲོད་ཀྱི་རྒྱུ་འབྱུང་བའི་རྐྱེན་དེ་དག་བསྡུས་ནས་འཇིག་པའི་ཚུལ་གྱིས་སྡུད་པར་བྱེད་པ་འདི་ནི་ལྷག་པའི་སེམས་ཀྱིས་མཐོང་བའི་ཆོས་ལ་བདེ་བར་གནས་པ་སྐྱོན་མེད་པ་ཐོབ་པ་གཉིས་པ་ཡིན་ཏེ།
en: “Again, they will think, ‘Now that I have gathered the conditions that lead to mental composure, I must collect myself by means of considering disintegration!’ This is the second attainment of faultlessness in those with superior minds, through which they will live happily in the present life.

source: ངན་ངོན་མ་ཡིན་པར་ཐོབ་པ་དང་། དཀའ་བ་མེད་པར་ཐོབ་པ་ཡིན་ནོ།
en: It will be achieved without difficulty or hardship.
